<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads pgAdmin3 and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.pgAdmin3.install</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>pgAdmin3</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>pgAdmin is the leading graphical Open Source management, development and administration tool for PostgreSQL.</string>
            <key>display_name</key>
            <string>pgAdmin3 - Postgresql GUI tools</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Developer Tools</string>
			<key>developer</key>
			<string>PostgreSQL Global Development Group</string>
		</dict>
	</dict>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.pgAdmin3.download</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>pgAdmin3.app</string>
                        <key>destination_path</key>
                        <string>%APP_DESTINATION%</string>
                    </dict>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
