<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads ne text editor for OS X dmg.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.ne.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ne</string>
        	<key>DOWNLOAD_URL</key>
        	<string>http://ne.di.unimi.it</string>
        	<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;[^"]+-(?P&lt;version&gt;[0-9\.]+)\.dmg)</string>
	</dict>
	<key>Process</key>
	<array>
	       <dict>
			<key>Processor</key>
           		<string>URLTextSearcher</string>
           		<key>Arguments</key>
            		<dict>
                		<key>url</key>
                		<string>%DOWNLOAD_URL%</string>
                		<key>re_pattern</key>
                		<string>%SEARCH_PATTERN%</string>
            		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%/%url%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
