<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat.ne.pkg</string>
	<key>Description</key>
	<string>Packages ne text editor for OS X.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ne</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.ne.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pathname%/%NAME%-%version%.pkg/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>CFBundleIdentifier</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>extract_root</key>
				<string>%pkgroot%</string>
				<key>pkg_path</key>
				<string>%pathname%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgExtractor</string>
		</dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                	<key>pkgname</key>
                	<string>%NAME%-%version%</string>
                	<key>version</key>
                	<string>%version%</string>
                    <key>id</key>
                    <string>%CFBundleIdentifier%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
