<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of TestDisk.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.download.TestDisk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TestDisk</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.cgsecurity.org</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%/wiki/TestDisk_Download</string>
                <key>re_pattern</key>
                <string>testdisk-\d+.\d+\.mac_intel\.tar\.bz2</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>%DOWNLOAD_URL%/%match%</string>
				<key>filename</key>
				<string>%NAME%.tar.bz2</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
