<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat.pkg.TestDisk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TestDisk</string>
        <key>BUNDLEID</key>
        <string>org.cgsecurity.TestDisk</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.download.TestDisk</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/source</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/source/testdisk-*</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>TestDiskVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>root_path</key>
                <string>%found_filename%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/build/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/bin</key>
                    <string>0755</string>
                    <key>usr/share</key>
                    <string>0755</string>
                    <key>usr/share/doc</key>
                    <string>0755</string>
                    <key>usr/share/doc</key>
                    <string>0755</string>
                    <key>usr/share/man</key>
                    <string>0755</string>
                    <key>usr/share/man/man8</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Move testdisk bin file</string>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%/testdisk</string>
                <key>target</key>
                <string>%pkgroot%/usr/bin/testdisk</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Move photorec bin file</string>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%/photorec</string>
                <key>target</key>
                <string>%pkgroot%/usr/bin/photorec</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Move fidentify bin file</string>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%/fidentify</string>
                <key>target</key>
                <string>%pkgroot%/usr/bin/fidentify</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Move testdisk man file to</string>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%/testdisk.8</string>
                <key>target</key>
                <string>%pkgroot%/usr/share/man/man8/testdisk.8</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Move photorec man file</string>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%/photorec.8</string>
                <key>target</key>
                <string>%pkgroot%/usr/share/man/man8/photorec.8</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Move fidentify man file</string>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%/fidentify.8</string>
                <key>target</key>
                <string>%pkgroot%/usr/share/man/man8/fidentify.8</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy remaining files to /usr/share/doc/testdisk</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/share/doc/testdisk</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                	<key>pkgname</key>
                	<string>%NAME%-%version%</string>
                	<key>pkgroot</key>
               		<string>%pkgroot%</string>
                	<key>version</key>
                	<string>%version%</string>
                    <key>id</key>
                    <string>%BUNDLEID%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr/bin/testdisk</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
				<key>mode</key>
				<string>0755</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr/bin/photorec</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
				<key>mode</key>
				<string>0755</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr/bin/fidentify</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
				<key>mode</key>
				<string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
