<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of AppCleaner and imports it into munki.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.AppCleaner.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AppCleaner</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utilities</string>
        <key>APP_DESTINATION</key>
        <string>/Applications/Utilities</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>AppCleaner is a small application which allows you to thoroughly uninstall unwanted apps.</string>
            <key>display_name</key>
            <string>AppCleaner Uninstaller Utility</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>OS Utilities</string>
            <key>developer</key>
            <string>FreeMacSoft</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.d33t5.download.AppCleaner</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--destinationpath</string>
                    <string>%APP_DESTINATION%</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
