<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Git and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.autopkg-recipes.Git.munki</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Git</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.</string>
            <key>display_name</key>
            <string>Git for Mac</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Developer Tools</string>
			<key>developer</key>
			<string>Tim Charper</string>
		</dict>
	</dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.autopkg-recipes.Git.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--destinationpath</string>
					<string>%APP_DESTINATION%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
