<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for GPG Suite. Finds and downloads a GPG Suite release.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.autopkg-recipes.GPGSuite.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GPGSuite</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GPGToolsURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0</string>
				</dict>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
