<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Pandoc.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.download.pandoc</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Pandoc</string>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>GITHUB_REPO</key>
		<string>jgm/pandoc</string>
		<key>ASSET_REGEX</key>
		<string>pandoc-.*%ARCH%-macOS.pkg</string>
		<key>INCLUDE_PRERELEASES</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%ASSET_REGEX%</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>include_prereleases</key>
				<string>%INCLUDE_PRERELEASES%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: John Macfarlane (5U2WKE6DES)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
	</array>
</dict>
</plist>
