<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Pandoc.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.download.pandoc</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Pandoc</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;/jgm/pandoc/releases/download/(?P&lt;version&gt;.*?)/pandoc-.*?.pkg)</string>
		<key>SEARCH_URL</key>
		<string>https://github.com/jgm/pandoc/releases</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg</string>
				<key>url</key>
				<string>https://github.com%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
