<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Pandoc disk image and installs Pandoc.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.install.pandoc</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.download.pandoc</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Processor</key>
	    <string>Installer</string>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
		<string>%pathname%</string>
	    </dict>
	</dict>
    </array>
</dict>
</plist>
