<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages the download of LightPaper.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.pkg.lightpaper</string>
	<key>Input</key>
    <dict>
	<key>NAME</key>
	<string>LightPaper</string>
    </dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.jleggat.download.lightpaper</string>
	<key>Process</key>
	<array>
	<dict>
	    <key>Processor</key>
	    <string>AppDmgVersioner</string>
	    <key>Arguments</key>
	    <dict>
		<key>dmg_path</key>
		<string>%pathname%</string>
	    </dict>
	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
	<dict>
	    <key>Processor</key>
	    <string>Copier</string>
	    <key>Arguments</key>
	    <dict>
		<key>source_path</key>
		<string>%pathname%/%app_name%</string>
		<key>destination_path</key>
		<string>%pkgroot%/Applications/%app_name%</string>
	    </dict>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>PkgCreator</string>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_request</key>
		<dict>
		    <key>pkgname</key>
		    <string>%NAME%-%version%</string>
		    <key>version</key>
		    <string>%version%</string>
		    <key>id</key>
		    <string>%bundleid%</string>
		    <key>options</key>
		    <string>purge_ds_store</string>
		    <key>chown</key>
		    <array>
			<dict>
			    <key>path</key>
			    <string>Applications</string>
			    <key>user</key>
			    <string>root</string>
			    <key>group</key>
			    <string>admin</string>
			</dict>
		    </array>
		</dict>
	    </dict>
	</dict>
	</array>
</dict>
</plist>
