<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest LightPaper disk image and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.munki.lightpaper</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LightPaper</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>LightPaper is a simple, beautiful, powerful yet free Text Editor for passionate writers. You can use LightPaper to write any kind of text documents – blogs, articles, notes, READMEs, TODOs, or the next chapter of your new novel.</string>
			<key>developer</key>
			<string>ClockworkEngine</string>
			<key>display_name</key>
			<string>LightPaper Text Editor</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.jleggat.pkg.lightpaper</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Processor</key>
	    <string>Unarchiver</string>
	    <key>Arguments</key>
	    <dict>
		<key>archive_path</key>
		<string>%pathname%</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>purge_destination</key>
		<true/>
	    </dict>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>DmgCreator</string>
	    <key>Arguments</key>
	    <dict>
		<key>dmg_root</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>dmg_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
	    </dict>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
		<string>%dmg_path%</string>
		<key>repo_subdirectory</key>
		<string>%MUNKI_REPO_SUBDIR%</string>
	    </dict>
	    <key>Processor</key>
	    <string>MunkiImporter</string>
	</dict>
    </array>

</dict>
</plist>
