<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of QLMarkdown and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.munki.qlmarkdown</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Install this plugin to preview your Markdown files with Quick Look.</string>
			<key>developer</key>
			<string>InkMark</string>
			<key>display_name</key>
			<string>Markdown Quick Look Plugin</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.jleggat.download.qlmarkdown</string>
	<key>Process</key>
	<array>
	<dict>
	    <key>Processor</key>
	    <string>Unarchiver</string>
	    <key>Arguments</key>
	    <dict>
		<key>archive_path</key>
		<string>%pathname%</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>purge_destination</key>
		<true/>
	    </dict>
	</dict>		<dict>
			<key>Arguments</key>
			<dict>
		<key>pkg_path</key>
		<string>%destination_path%/QLMarkdown.mpkg/Contents/Packages/QLMarkdown.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
