<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs the current release version of QLMarkdown.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.install.qlmarkdown</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.download.qlmarkdown</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Processor</key>
	    <string>Unarchiver</string>
	    <key>Arguments</key>
	    <dict>
		<key>archive_path</key>
		<string>%pathname%</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>purge_destination</key>
		<true/>
	    </dict>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>Installer</string>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
		<string>%destination_path%/QLMarkdown.mpkg</string>
	    </dict>
	</dict>
    </array>
</dict>
</plist>
