<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest MacDown archive and installs MacDown.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.install.macdown</string>
    <key>Input</key>
    <dict>
	    <key>NAME</key>
		<string>MacDown</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.download.macdown</string>
    <key>Process</key>
    <array>
	<dict>
	    <key>Processor</key>
	    <string>Unarchiver</string>
	    <key>Arguments</key>
	    <dict>
		<key>archive_path</key>
		<string>%pathname%</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>purge_destination</key>
		<true/>
	    </dict>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>DmgCreator</string>
	    <key>Arguments</key>
	    <dict>
		<key>dmg_root</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>dmg_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
	    </dict>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>InstallFromDMG</string>
	    <key>Arguments</key>
	    <dict>
		<key>dmg_path</key>
		<string>%dmg_path%</string>
		<key>items_to_copy</key>
		<array>
		    <dict>
			<key>source_item</key>
			<string>MacDown.app</string>
			<key>destination_path</key>
			<string>/Applications/</string>
		    </dict>
		</array>
	    </dict>
	</dict>
    </array>
</dict>
</plist>
