<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads PackageUninstaller dmg for OS X.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.autopkg-recipes.PackageUninstaller.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PackageUninstaller</string>
		<key>FILE_PATTERN</key>
		<string>.*\.zip</string>
		<key>DOWNLOAD_URL</key>
		<string>http://sourceforge.net/projects/packageuninstaller/rss</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>http://.*Uninstaller\.app\..*\.zip/download</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>%match%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
