<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of pngout.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.pngout.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>pngout</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.jonof.id.au/kenutils.html</string>
        <key>DOWNLOAD_PATTERN</key>
       	<string>href="/files/kenutils/pngout-(?P&lt;version&gt;[\d]+)-mac\.zip"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>%DOWNLOAD_PATTERN%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>https://www.jonof.id.au/files/kenutils/pngout-%version%-mac.zip</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
