<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.autopkg.jleggat-recipes.download.screenFetch</string>
	<key>Description</key>
	<string>Downloads screenFetch for packaging.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>screenFetch</string>
		<key>REPO_NAME</key>
		<string>KittyKatt/screenFetch</string>
		<key>TAG</key>
		<string>latest</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_name</key>
				<string>%REPO_NAME%</string>
				<key>tag</key>
				<string>%TAG%</string>
			</dict>
			<key>Processor</key>
			<string>GithubTagProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/KittyKatt/screenFetch/archive/v%version%.zip</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
