<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat-recipes.pkg.screenFetch</string>
	<key>Description</key>
	<string>Packages screenFetch utility.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>screenFetch</string>
        	<key>BUNDLEID</key>
                    <string>com.github.kittykatt.screenfetch</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat-recipes.download.screenFetch</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/source</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/bin</key>
                    <string>0755</string>
                    <key>usr/share</key>
                    <string>0755</string>
                    <key>usr/share/man</key>
                    <string>0755</string>
                    <key>usr/share/man/man1</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy screenfetch executable to /usr/bin/screenfetch</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/source/screenFetch-%version%/screenfetch-dev</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/bin/screenfetch</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy screenfetch.1 bin man file to /usr/share/man/man1/screenfetch.1</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/source/screenFetch-%version%/screenfetch.1</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/share/man/man1/screenfetch.1</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                	<key>pkgname</key>
                	<string>%NAME%-%version%</string>
                	<key>version</key>
                	<string>%version%</string>
                    <key>id</key>
                    <string>%BUNDLEID%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr/bin/screenfetch</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
