<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Validator S.A.C.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.ValidatorSAC.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ValidatorSAC</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Validator S.A.C. (Stand Alone Complex) is a stand-alone, easy to install, version of the W3C's HTML / XHTML Markup Validator for Mac OS X.</string>
            <key>display_name</key>
            <string>Validator S.A.C.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
			<key>category</key>
			<string>OS Utilities</string>
			<key>developer</key>
			<string>Homo Habilis Associates</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.ValidatorSAC.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
		<key>munkiimport_appname</key>
		<string>Validator-SAC.app</string>
		<key>additional_makepkginfo_options</key>
		<array>
			<string>--destinationpath</string>
			<string>%APP_DESTINATION%</string>
		</array>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
