<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat.pkg.Webmin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Webmin</string>
        <key>BUNDLEID</key>
        <string>com.webmin.Webmin</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.download.Webmin</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/build/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>private</key>
                    <string>0755</string>
                    <key>private/var</key>
                    <string>0755</string>
                    <key>private/var/webmin</key>
                    <string>0700</string>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/libexec</key>
                    <string>0755</string>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/LaunchDaemons</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/libexec</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>make launchd plist for Webmin at /Library/LaunchDaemons</string>
            <key>Processor</key>
            <string>PlistEditor</string>
            <key>Arguments</key>
            <dict>
                <key>output_plist_path</key>
                <string>%pkgroot%/Library/LaunchDaemons/com.webmin.webmin.plist</string>
                <key>plist_data</key>
				<dict>
					<key>UserName</key>
					<string>root</string>
					<key>Label</key>
					<string>com.webmin.webmin</string>
					<key>OnDemand</key>
					<false/>
					<key>RunAtLoad</key>
					<true/>
					<key>ProgramArguments</key>
					<array>
						<string>/etc/webmin/start</string>
					</array>
				</dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>version</key>
                <string>%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%BUNDLEID%</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>private</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>private/var/webmin</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>bin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
