<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ack file.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.ack.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ack</string>
        <key>DOWNLOAD_URL</key>
        <string>https://beyondgrep.com</string>
        <key>DOWNLOAD_PATTERN</key>
       	<string>&lt;a href="(ack-.*-single-file)"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        	<dict>
        	    <key>Processor</key>
        	    <string>URLTextSearcher</string>
        	    <key>Arguments</key>
        	    <dict>
        	        <key>url</key>
        	        <string>%DOWNLOAD_URL%/install</string>
        	        <key>re_pattern</key>
        	        <string>%DOWNLOAD_PATTERN%</string>
        	    </dict>
        	</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%/%match%</string>
                <key>filename</key>
                <string>%NAME%.pl</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
