<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ack file, builds a package around it and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.ack.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ack</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>support/perl</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ack is a grep-like tool that is specifically created to make searching source code easier
Designed for programmers with large heterogeneous
        trees of source code, ack is written purely in
        portable Perl 5 and takes advantage of the power of
        Perl's regular expressions.</string>
            <key>display_name</key>
            <string>ack PERL Module</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
			<key>category</key>
			<string>Developer Tools</string>
			<key>developer</key>
			<string>Andy Lester</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.ack.pkg</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
