<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat-recipes.munki.archey-osx</string>
	<key>Description</key>
	<string>Imports archey-osx into Munki.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>archey-osx</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A script for OS X to display system information.</string>
            <key>display_name</key>
            <string>archey-osx - An archey script for OS X.</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>OS Information</string>
			<key>developer</key>
			<string>Jeffrey Hann</string>
		</dict>
	</dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat-recipes.pkg.archey-osx</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
	</array>
</dict>
</plist>
