<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of MacVim where MAJOR_OS_VERSION is Snow-Leopard, Mountain-Lion or Mavericks (default).</string>
	<key>Identifier</key>
	<string>com.github.jleggat.MacVim.pkg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MacVim</string>
        <key>BUNDLEID</key>
        <string>com.fetchsoftworks.Fetch</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.MacVim.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/source</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/source/MacVim-*</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%found_filename%/MacVim.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/build/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0755</string>
                    <key>usr/local/bin</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy MacVim.app to /Applications</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%/MacVim.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/MacVim.app</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy mvim to /usr/local/bin</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%/mvim</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/bin/mvim</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Symlink /usr/local/bin/mvim to /usr/local/bin/vim</string>
            <key>Processor</key>
            <string>Symlinker</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>/usr/local/bin/mvim</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/bin/vim</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Symlink /usr/local/bin/mvim to /usr/local/bin/vi</string>
            <key>Processor</key>
            <string>Symlinker</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>/usr/local/bin/mvim</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/bin/vi</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
        	        <key>pkgname</key>
        	        <string>%NAME%-%version%</string>
                	<key>version</key>
                	<string>%version%</string>
                    <key>id</key>
                    <string>%BUNDLEID%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr/local/bin/mvim</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
				<key>mode</key>
				<string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
