<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of libwebp.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.libwebp.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>libwebp</string>
        <key>DOWNLOAD_URL</key>
        <string>https://developers.google.com/speed/webp/download</string>
        <key>DOWNLOAD_PATTERN</key>
       	<string>([^"]+libwebp-(?P&lt;version&gt;[0-9\.]+)-mac-.*\.tar\.gz)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
        	<string>%DOWNLOAD_PATTERN%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>%match%</string>
				<key>filename</key>
				<string>%NAME%.tar.gz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
