<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat.libwebp.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>libwebp</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>support/libwebp</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>WebP is a new image format that provides lossless and lossy compression for images on the web. WebP lossless images are 26% smaller in size compared to PNGs. WebP lossy images are 25-34% smaller in size compared to JPEG images at equivalent SSIM index. WebP supports lossless transparency (also known as alpha channel) with just 22% additional bytes. Transparency is also supported with lossy compression and typically provides 3x smaller file sizes compared to PNG when lossy compression is acceptable for the red/green/blue color channels.

Webmasters and web developers can use the WebP image format to create smaller and richer images that can help make the web faster.</string>
            <key>display_name</key>
            <string>libwebp - A new image format for the Web</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
			<key>category</key>
			<string>System Utilities</string>
			<key>developer</key>
			<string>Google Developers</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstallable</key>
			<true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.libwebp.pkg</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
