<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat.autopkg-recipes.pkg.Monit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Monit</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.autopkg-recipes.download.Monit</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%destination_path%</string>
            </dict>
            <key>Processor</key>
            <string>MonitSourceFinder</string>
        </dict>
         <dict>
            <key>Processor</key>
            <string>MonitVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>root_path</key>
                <string>%Monit_path%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/build/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>private</key>
                    <string>0755</string>
                    <key>private/etc</key>
                    <string>0755</string>
                    <key>private/etc/monit.d</key>
                    <string>0700</string>
                    <key>private/var</key>
                    <string>0755</string>
                    <key>private/var/monit</key>
                    <string>0700</string>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/share</key>
                    <string>0755</string>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/LaunchDaemons</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy monit bin folder to /usr/bin</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%Monit_path%/bin</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/bin</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy monit man folder to /usr/share/man</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%Monit_path%/man</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/share/man</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy monit conf/monitrc file to /private/etc/monitrc.default</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%Monit_path%/conf/monitrc</string>
                <key>destination_path</key>
                <string>%pkgroot%/private/etc/monitrc.default</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>make launchd plist for monit at /Library/LaunchDaemons</string>
            <key>Processor</key>
            <string>PlistEditor</string>
            <key>Arguments</key>
            <dict>
                <key>output_plist_path</key>
                <string>%pkgroot%/Library/LaunchDaemons/com.monit.mmonit.plist</string>
                <key>plist_data</key>
				<dict>
					<key>UserName</key>
					<string>root</string>
					<key>Label</key>
					<string>com.monit.mmonit</string>
					<key>OnDemand</key>
					<false/>
					<key>RunAtLoad</key>
					<true/>
					<key>ProgramArguments</key>
					<array>
						<string>/usr/bin/monit</string>
						<string>-c</string>
						<string>/etc/monitrc</string>
						<string>-I</string>
						<string>-l</string>
						<string>/var/log/monit.log</string>
					</array>
				</dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>org.vim.Monit</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>resources</key>
                    <string>Resources</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>private</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
