<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Monit.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.autopkg-recipes.Monit.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Monit</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://b4winckler.github.com/Monit/appcast/stable.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>MonitURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.tar.gz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
