<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Monit.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.download.Monit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Monit</string>
        <key>SEARCH_URL</key>
        <string>https://mmonit.com/monit/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>dist/binary/.*/monit-.*-macosx-x64\.tar\.gz</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>%SEARCH_URL%%match%</string>
				<key>filename</key>
				<string>%NAME%.tar.gz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
