<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Wireshark. Finds and downloads a Wireshark release.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.autopkg-recipes.Wireshark.download</string>
	<key>SOURCEFORGE_FILE_PATTERN</key>
	<string>osx\/Wireshark [0-9_\.]* Intel 64\.dmg</string>
	<key>SOURCEFORGE_PROJECT_ID</key>
	<string>255</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wireshark</string>
		<key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SourceForgeURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
				<key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
