<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Wireshark.</string> 
	<key>Identifier</key>
	<string>com.github.jleggat.Wireshark.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Wireshark</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download.html</string>
                <key>re_pattern</key>
                <string>href="(?P&lt;match&gt;https?:\/\/[^"]*/?osx/Wireshark[^"]*Intel[^"]*64\.dmg)"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Wireshark*.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Wireshark Foundation, Inc. (7Z6EMTD2C6)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
