<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Wireshark and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jleggat.Wireshark.munki</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Wireshark</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Wireshark.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Wireshark is a powerful network protocol analysis suite.</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Network Utilities</string>
			<key>developer</key>
			<string>Wireshark Foundation</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
if [ -d "/Applications/Wireshark.app" ]; then
	# Add directory traversal for the entire application and ensure 
	# all executables are executable by group and other
	/bin/chmod -R u=rwX,go=rX /Applications/Wireshark.app
fi
			</string>
			<key>minimum_os_version</key>
			<string>10.12.0</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jleggat.pkg.Wireshark</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
