<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Postgres.app.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.PostgresApp.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PostgresApp</string>
        <!--Postgres.app with PostgreSQL 11 binary: https://postgresapp.com/sparkle/updates_11.xml
        Postgres.app with PostgreSQL 9.5, 9.6, 10 and 11 binaries: https://postgresapp.com/sparkle/updates_9.5_9.6_10_11.xml-->
        <key>appcast_url</key>
        <string>https://postgresapp.com/sparkle/updates_9.5_9.6_10_11.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>SparkleUpdateInfoProvider</string>
          <key>Arguments</key>
          <dict>
              <key>appcast_url</key>
              <string>%APPCAST_URL%</string>
          </dict>
      </dict>
        <dict>
			<key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
