<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Postgres.app.</string>
    <key>Identifier</key>
	   <string>com.github.jleggat.PostgresApp.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PostgresApp</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
    		<key>APP_DESTINATION</key>
    		<string>/Applications</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>the easiest way to run PostgreSQL on the Mac</string>
            <key>display_name</key>
            <string>Postgres.app</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
      			<key>category</key>
      			<string>Developer Tools</string>
      			<key>developer</key>
      			<string>PostgreSQL Global Development Group</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.PostgresApp.download</string>
    <key>Process</key>
  	<array>
  		<dict>
      	<key>Processor</key>
  			<string>MunkiImporter</string>
  			<key>Arguments</key>
  			<dict>
  				<key>pkg_path</key>
  				<string>%pathname%</string>
  				<key>repo_subdirectory</key>
  				<string>%MUNKI_REPO_SUBDIR%</string>
  			</dict>
  		</dict>
  	</array>
</dict>
</plist>
