<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jleggat.AdobeShockwavePlayer.pkg</string>
	<key>Description</key>
	<string>Packages Adobe Shockwave Player from downloaded disk image.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeShockwavePlayer</string>
        	<key>BUNDLEID</key>
        	<string>com.fetchsoftworks.Fetch</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.download.AdobeShockwavePlayer</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
         <dict>
            <key>Processor</key>
            <string>AdobeShockwaveVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_file_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Distribution</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/shockwave*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/build/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%found_filename%/Payload</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library</string>
                <key>archive_format</key>
                <string>tar_gzip</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
	                <key>pkgname</key>
	                <string>%NAME%-%version%</string>
	                <key>version</key>
	                <string>%version%</string>
                	<key>pkgroot</key>
                	<string>%pkgroot%</string>
                  <key>id</key>
                    <string>%id%</string>
                    <key>scripts</key>
                    <string>%found_filename%/Scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
