<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest sqlitebrowser disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.sqlitebrowser.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>sqlitebrowser</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
	<key>APP_DESTINATION</key>
	<string>/Applications</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>DB Browser for SQLite is a high quality, visual, open source tool to create, design, and edit database files compatible with SQLite.</string>
            <key>display_name</key>
            <string>sqlitebrowser</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
		<key>category</key>
		<string>Developer Tools</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.sqlitebrowser.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
		<key>additional_makepkginfo_options</key>
		<array>
			<string>--destinationpath</string>
			<string>%APP_DESTINATION%</string>
		</array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
