<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Transmission and installs it.</string>
    <key>Identifier</key>
	<string>com.github.jleggat.Transmission.install</string>
    <key>Input</key>
    <dict>
        	<key>NAME</key>
        	<string>Transmission</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.Transmission.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>Transmission.app</string>
                        <key>destination_path</key>
                        <string>%APP_DESTINATION%</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
