<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest cpanm file, builds a package around it and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.autopkg-recipes.cpanm.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>cpanm</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>support/perl</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>cpanminus is a script to get, unpack, build and install modules from
    CPAN and does nothing else.

    It's dependency free (can bootstrap itself), requires zero
    configuration, and stands alone. When running, it requires only 10MB of
    RAM.</string>
            <key>display_name</key>
            <string>cpanm PERL Module</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jleggat.autopkg-recipes.cpanm.pkg</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
